content/post/2025/11/06/lisp-1.org
#+title: Building a Lisp Interpreter (in Rust) - Part 1
#+date: 2025-11-06
#+author: Will S. Medrano

* Why Lisp

Implementing a compiler or interpreter is fun but intimidating to start
with. However, Lisp is a great starting point. Although it’s infamous for being
riddled with "unreadable parentheses," the parentheses actually keep things
simple.

To write Lisp code, you write down the Lisp data structure itself. Evaluating a
Lisp program involves two steps:

1. ~read~ - Read the text into a Lisp data structure.
2. ~eval~ - Evaluate that structure according to Lisp’s simple rules.

#+BEGIN_SRC scheme
12 ;; An integer, 12
#true ;; A boolean

;; A list containing the identifier +, and the integers 1 and 2.
;; This expression specifically invokes the + function with arguments 1 and 2.
;; The result of evaluating this list is 3.
(+ 1 2)
#+END_SRC

* Goal

In this post, we will use Rust to *implement only the ~read~ step*. We’ll
evaluate expressions in Part 2 and implement custom functions in Part 3.

Our implementation will favor readability over performance. In some cases (such
as list storage design), we’ll also diverge from traditional Lisp
implementations for clarity. If you want a well-defined reference
implementation, check out the [[https://r7rs.org/][Scheme R7RS specification]].


* Representing Lisp Data

Lisp is dynamically typed, like JavaScript or Python. Dynamic typing means that
the type of a variable is determined at runtime.

#+BEGIN_SRC scheme
(define x 100) ;; x is an integer
(set! x #true) ;; now x is a boolean

...

;; At this point, we might be able to guess the type,
;; but there are no guarantees about what x is.
(+ x 100)
#+END_SRC

To implement dynamic typing, we’ll define a single enum that contains all
possible Lisp values. Integers and booleans can be represented as ~i64~ and
~bool~, respectively. Symbols (identifiers) will be stored as ~String~.



** Lists

Lists in Lisp are typically *linked lists*. A linked list is a node containing
an element and a reference to the rest of the list. In Rust, a basic version
might look like:

#+BEGIN_SRC rust
pub struct LinkedListNode<T> {
    item: T,
    rest: Option<Box<LinkedListNode<T>>>,
}
#+END_SRC

However, in the spirit of Lisp’s dynamic typing, lists are often represented as
*pairs*—where the first item points to the head element (~car~), and the second
points to the rest (~cdr~), which is either another pair or ~null~.

#+BEGIN_SRC rust
pub struct Pair {
    // To make things more proper, instead of `first` and `second`,
    // the traditional Lisp names `car` and `cdr` are used.
    //
    // Nobody remembers what they originally stand for.
    car: Val,
    cdr: Val,
}
#+END_SRC

That said, we’ll take a simpler approach for our interpreter and represent lists
as ~Vec<Val>~, largely because Rust’s pattern matching works beautifully with
slices.


** Final Design

Our final data structure will have four variants. It’s easy to add new datatypes
later; just add another enum variant!

#+BEGIN_SRC rust
pub enum Val {
    Int(i64),
    Bool(bool),
    Symbol(String),
    List(Vec<Val>),
}
#+END_SRC

* Parsing

Parsing text into a ~Val~ involves two steps:

1. Tokenization - Split the text into meaningful tokens.
2. Reading - Convert the sequence of tokens into Lisp values.



