content/post/2025/11/06/lisp-1.org
** Tokenization

The tokenizer splits the text into identifiers and symbols. We’ll split by whitespace, treating ~(~ and ~)~ as separate tokens.

#+BEGIN_SRC rust
#[test]
fn test_tokenizer() {
    let mut tokenizer = Tokenizer::new("12 #true (+ 1 2)");
    assert_eq!(
        tokenizer.try_collect::<Vec<&str>>().unwrap(),
        &["12", "#true", "(", "+", "1", "2", ")"]
    );
}
#+END_SRC

This part isn’t too exciting, so here’s a code dump. Our tokenizer is simple, but could be extended later to handle:

- String literals: for example, `"also (include this) in string"` should remain one token.
- Source positions: for debugging or error reporting, you might want tokens to include ~start~ and ~end~ positions instead of just the text slice.

#+BEGIN_SRC rust
#[derive(Debug, Clone)]
pub struct Tokenizer<'a> {
    input: &'a str,
    position: usize,
}

impl<'a> Iterator for Tokenizer<'a> {
    type Item = &'a str;

    fn next(&mut self) -> Option<Self::Item> {
        // Skip whitespace.
        if let Some(offset) = self.input.chars().position(|c| !c.is_whitespace()) {
            self.position += offset
        }
        if self.position >= self.input.len() {
            return None;
        }

        // Handle parens
        let start = self.position;
        let ch = &self.input[start..start + 1];
        if matches!(ch, "(" | ")") {
            self.position += 1;
            return Some(ch);
        }
        // Handle identifiers
        let token = self.input.get(start..)?
            .split(|c| c.is_whitespace() || c == '(' || c == ')')
            .next()?;
        self.position += token.len();
        Some(token)
    }
}

impl<'a> Tokenizer<'a> {
    pub fn new(input: &'a str) -> Self {
        Self { input, position: 0 }
    }
}
#+END_SRC


