public/post/2025/11/06/lisp-1.html
<div id="outline-container-orgebbd2d5" class="outline-3">
<h3 id="orgebbd2d5"><span class="section-number-3">4.1.</span> Tokenization</h3>
<div class="outline-text-3" id="text-4-1">
<p>
The tokenizer splits the text into identifiers and symbols. We’ll split by whitespace, treating <code>(</code> and <code>)</code> as separate tokens.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span class="org-preprocessor">#[test]</span>
<span class="org-keyword">fn</span> <span class="org-function-name">test_tokenizer</span>() {
    <span class="org-keyword">let</span> <span class="org-keyword">mut</span> <span class="org-variable-name">tokenizer</span> = <span class="org-type">Tokenizer</span>::new(<span class="org-string">"12 #true (+ 1 2)"</span>);
    <span class="org-preprocessor">assert_eq!</span>(
        tokenizer.collect::&lt;<span class="org-type">Vec</span>&lt;_&gt;&gt;(),
        <span class="org-rust-ampersand">&amp;</span>[<span class="org-string">"12"</span>, <span class="org-string">"#true"</span>, <span class="org-string">"("</span>, <span class="org-string">"+"</span>, <span class="org-string">"1"</span>, <span class="org-string">"2"</span>, <span class="org-string">")"</span>]
    );
}
</pre>
</div>

<p>
The tokenizer is pretty boring, so here’s a code dump.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span class="org-preprocessor">#[derive(Debug, Clone)]</span>
<span class="org-keyword">pub</span> <span class="org-keyword">struct</span> <span class="org-type">Tokenizer</span>&lt;'<span class="org-variable-name">a</span>&gt; {
    <span class="org-variable-name">input</span>: <span class="org-rust-ampersand">&amp;</span>'<span class="org-variable-name">a</span> <span class="org-type">str</span>,
    <span class="org-variable-name">position</span>: <span class="org-type">usize</span>,
}

<span class="org-keyword">impl</span>&lt;'<span class="org-variable-name">a</span>&gt; <span class="org-type">Iterator</span> <span class="org-keyword">for</span> <span class="org-type">Tokenizer</span>&lt;'<span class="org-variable-name">a</span>&gt; {
    <span class="org-keyword">type</span> <span class="org-type">Item</span> = <span class="org-rust-ampersand">&amp;</span>'<span class="org-variable-name">a</span> <span class="org-type">str</span>;

    <span class="org-keyword">fn</span> <span class="org-function-name">next</span>(<span class="org-rust-ampersand">&amp;</span><span class="org-keyword">mut</span> <span class="org-keyword">self</span>) -&gt; <span class="org-type">Option</span>&lt;<span class="org-type">Self</span>::<span class="org-type">Item</span>&gt; {
        <span class="org-comment-delimiter">// </span><span class="org-comment">Skip whitespace.
</span>        <span class="org-keyword">if</span> <span class="org-keyword">let</span> <span class="org-type">Some</span>(offset) = <span class="org-keyword">self</span>.input[<span class="org-keyword">self</span>.position..]
            .chars()
            .position(|c| !c.is_whitespace())
        {
            <span class="org-keyword">self</span>.position += offset
        }
        <span class="org-keyword">if</span> <span class="org-keyword">self</span>.position &gt;= <span class="org-keyword">self</span>.input.len() {
            <span class="org-keyword">return</span> <span class="org-type">None</span>;
        }

        <span class="org-comment-delimiter">// </span><span class="org-comment">Handle parens
</span>        <span class="org-keyword">let</span> <span class="org-variable-name">start</span> = <span class="org-keyword">self</span>.position;
        <span class="org-keyword">let</span> <span class="org-variable-name">ch</span> = <span class="org-rust-ampersand">&amp;</span><span class="org-keyword">self</span>.input[start..start + 1];
        <span class="org-keyword">if</span> <span class="org-preprocessor">matches!</span>(ch, <span class="org-string">"("</span> | <span class="org-string">")"</span>) {
            <span class="org-keyword">self</span>.position += 1;
            <span class="org-keyword">return</span> <span class="org-type">Some</span>(ch);
        }
        <span class="org-comment-delimiter">// </span><span class="org-comment">Handle identifiers
</span>        <span class="org-keyword">let</span> <span class="org-variable-name">token</span> = <span class="org-keyword">self</span>
            .input
            .get(start..)<span class="org-rust-question-mark">?</span>
            .split(|<span class="org-variable-name">c</span>: <span class="org-type">char</span>| c.is_whitespace() || c == <span class="org-string">'('</span> || c == <span class="org-string">')'</span>)
            .next()<span class="org-rust-question-mark">?</span>;
        <span class="org-keyword">self</span>.position += token.len();
        <span class="org-type">Some</span>(token)
    }
}

<span class="org-keyword">impl</span>&lt;'<span class="org-variable-name">a</span>&gt; <span class="org-type">Tokenizer</span>&lt;'<span class="org-variable-name">a</span>&gt; {
    <span class="org-keyword">pub</span> <span class="org-keyword">fn</span> <span class="org-function-name">new</span>(<span class="org-variable-name">input</span>: <span class="org-rust-ampersand">&amp;</span>'<span class="org-variable-name">a</span> <span class="org-type">str</span>) -&gt; <span class="org-type">Self</span> {
        <span class="org-type">Self</span> { input, <span class="org-variable-name">position</span>: 0 }
    }
}
</pre>
</div>

<p>
The tokenizer is simple, but could be extended later to handle:
</p>

<ul class="org-ul">
<li>String literals: for example, `"also (include this) in string"` should remain one token.</li>
<li>Source positions: for debugging or error reporting, you might want tokens to include <code>start</code> and <code>end</code> positions instead of just the text slice.</li>
</ul>
</div>
</div>
